app/views/student_score/edit.html.erb

SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]
---
        </tr>
    <%@student.score.each do |s|%>