app/controllers/st_score_controller.rb

SELECT "students".* FROM "students"
---
  def home
    @student = nil
    Student.all.each do |std|

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 1]]
---
  def delete
    Score.destroy_by(id: params[:id])