app/controllers/student_score_controller.rb

SELECT "students".* FROM "students"
---
  def edit
    @student = nil
    Student.all.each do |std|